---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AllModelManufacturer
source: html/5f455643-8a14-7952-e3f8-021856685cbf.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AllModelManufacturer Property

"Manufacturer"

## Syntax (C#)
```csharp
public static ForgeTypeId AllModelManufacturer { get; }
```